{
    "title1": "What Is Agile ?",
    "title2": "Examples",
    "title3": "Result",
    "paragraph1": "Agile is one of the methodologies used in project management to involve the customer more in the process, to prevent errors and complexity in development moments, and to minimise unexpected situations by documenting the process. However, since it is assumed that software products are not conventional projects, it is important to involve the customer in the process and prevent confusion that may arise. The product manager or business analyst in the application teams is the bridge between the customer and the developer. The reason for the emergence of the methodology is that the human factor is very effective in software and that the desired and understood situations related to a product, a module or even a function may be different. However, the time cost of going back in the processes, architectural structures on the code side and customer demands are factors that cannot be ignored in project development processes.",
    "paragraph2": "Let's consider two different situations, one in which the customer is not involved in the process and one in which the customer is involved in the processes, for a software implementation that is planned to last 1 year in total. In the 1st case, you are progressing through the processes and about 6 months pass and you see that certain modules related to the application are working and when you show the product in your hand at the mvp meeting with the customer, it is possible to encounter a situation where the working parts are not as the customer wants. In case 2, you are unlikely to encounter such a situation in the scenario where you involve the customer in the process from the very first moment, but at the end of the day, the resulting product belongs to the customer and so do you. He wasn't asked to do anything different. Moreover, in the long run, it is easier to adopt something that you see frequently in terms of application usage, visual habit and conscious awareness.",
    "paragraph3": "Involving the customer in the processes and preventing confusion that may arise later is important for software project processes.",
    "paragraph4": "The software developer and the technical team should not be expected to have the know-how behind the developed product, so customer demands should be documented and a technical language should be created for the software developer.",
    "paragraph5": "It is important to segment the work at the starting point in order not to exceed the deadlines for the delivery of the project and to monitor the performance in the process.",
    "paragraph6": "Works divided into small pieces will feel more complete in the human mind. Rather than a large module and spending months trying to complete a single item. Preference will be given to completing smaller parts of that larger module each week."
}