{
    "title1": "Що таке Agile ?",
    "title2": "Приклади",
    "title3": "Результат",
    "paragraph1": "Agile — це одна з методологій, які використовуються в управлінні проектами, щоб більше залучати клієнта до процесу, запобігати помилкам і складності в моменти розробки, а також мінімізувати несподівані ситуації шляхом документування процесу. Однак, оскільки передбачається, що програмні продукти не є звичайними проектами, важливо залучити клієнта до процесу та запобігти плутанині, яка може виникнути. Менеджер із продуктів або бізнес-аналітик у командах із розробки додатків є сполучною ланкою між клієнтом і розробником. Причина появи методології полягає в тому, що людський фактор дуже ефективний у програмному забезпеченні і що бажані та зрозумілі ситуації, пов’язані з продуктом, модулем або навіть функцією, можуть бути різними. Однак витрати часу на повернення до процесів, архітектурні структури на стороні коду та вимоги клієнтів є факторами, які не можна ігнорувати в процесах розробки проекту.",
    "paragraph2": "Давайте розглянемо дві різні ситуації, коли замовник не залучений до процесу, і замовник залучений до процесів, для впровадження програмного забезпечення, яке заплановано на 1 рік. У першому випадку ви просуваєтесь через процеси, і минає близько 6 місяців, і ви бачите, що певні модулі, пов’язані з програмою, працюють, і коли ви показуєте продукт у своїй руці на зустрічі mvp із клієнтом, можна зіткнутися з ситуація, коли робочі частини не такі, як хоче клієнт. У випадку 2 ви навряд чи зіткнетеся з такою ситуацією в сценарії, коли ви залучаєте клієнта до процесу з самого першого моменту, але в кінці дня отриманий продукт належить клієнту, і ви теж. Його не просили робити щось інше. Більше того, у довгостроковій перспективі легше прийняти те, що ви часто бачите з точки зору використання програми, візуальної звички та свідомого усвідомлення.",
    "paragraph3": "Залучення клієнта до процесів і запобігання плутанини, яка може виникнути пізніше, є важливими для процесів проекту програмного забезпечення.",
    "paragraph4": "Розробник програмного забезпечення та технічна команда не повинні мати ноу-хау, що лежить в основі розробленого продукту, тому вимоги клієнтів повинні бути задокументовані, а для розробника програмного забезпечення має бути створена технічна мова.",
    "paragraph5": "Важливо сегментувати роботу на стартовій точці, щоб не перевищувати терміни здачі проекту та контролювати виконання в процесі.",
    "paragraph6": "Твори, розділені на невеликі частини, будуть сприйматися в людському розумі більш завершено. Замість великого модуля та витрачання місяців на завершення одного елемента. Перевага надаватиметься виконанню менших частин більшого модуля щотижня."
}